a, b = "48", 'that_s_try'
g, h, k, n = 99, 109763454547, -7, 0
p, q, r = 1.65632598, -25468.3, 45.7

# начинаем сравнивать int


# знак >

# 1)
if g > h:
    print('g', 'больше чем', "h")
else:
    print("g", "меньше чем", 'h')
# 2)
if h - k > 0:
    print('h', 'больше чем', "k")
else:
    print("h", "меньше чем", 'k')
# 3)
if n > k:
    print('n', 'больше чем', "k")
else:
    print("n", "меньше чем", 'k')

# теперь знак <

# 4)
if n < k:
    print('n', "меньше чем", "k")
else:
    print("n", 'больше чем', 'k')
# 5)
if h - k < 0:
    print('h', "меньше чем", "k")
else:
    print("h", 'больше чем', 'k')
# 6)
if (g + n) < (h + k):
    print('сумма крайних переменных меньше суммы внутренних переменных')
else:
    print("сумма крайних переменных больше суммы внутренних переменных")
# а теперь >=

# 7)
if h >= 0:
    print('это неотрицательное число')
else:
    print('это отрицательное число')

# 8)
if k >= 0:
    print('это неотрицательное число')
else:
    print('это отрицательное число')
# 9)
if k >= n:
    print('положительное значение')
else:
    print("отрицательное значение")
# ок, добрались до <=

# 10)
if g + h + k <= n:
    print('увы, но сумма отрицательная')
else:
    print("сумма первых трех чисел положительная")
# 11)
if k <= n:
    print('ваш баланс отрицательный')
else:
    print('радуйтесь, баланс положительный')
# 12)
if h <= n:
    print('плохо работал - остался без зарплаты')
else:
    print("Дорогой друг, твоя зарплата в этом месяце", h, " рублей, и это только начало, скоро будет премия с авансом!")
# осталось сделать !=

# 13)
if g / k != n:
    print('мы придумали хороший способ')
else:
    print("марш на работу и думай, как это исправить")
# 14)
if g / h != n / k:
    print('все правильно в этом мире')
else:
    print('мир сошел с рельс, берегитесь')
# 15)
if k != n:
    print('так и было задумано')
else:
    print('ты ошибаешься, бро!')

# Мы добрались к Float, почти середина

# 1)
if p < q:
    print('это отрицательное число')
else:
    print('возможно, положительное, но не точно')

# 2)
if p * q < 0:
    print('так и было задумано, бро!')
else:
    print('пойди проспись')

# 3)
if r <= p / 50:
    print('у тебя запятая гуляет')
else:
    print('а потому что так и было задумано')

# 4)
if q > p * r:
    print('минус, минус потерялся, робяты')
else:
    print("расходимся, братцы, все правильно")

# 5)
if p >= r:
    print('ну не знаюююю')
else:
    print('я прав, и вот этому доказательства')

# 6)
if q * 0 != 0:
    print('есть не только геометрия Лобачевского, но и алгебра?')
else:
    print('делить на 0 нельзя, а умножать зяяяя')

# 7)
if p * r > r:
    print('значит,', p, 'положительное число')
else:
    print('видимо,', p, 'отрицательное или 0')

# 8)
if p != q:
    print('разные они просто, вот и все')
else:
    print('да посмотри внимательнее, там даже знаки разные')

# 9)
if q * r >= p:
    print('я попала в параллельную вселенную?')
else:
    print("этот мир незыблем!")

# А теперь в бой идут операторы

# 1)
if g > n and h > k:
    print('неа, ошибочка')
else:
    print("правильно говоришь, дядя Федор")

# 2)
if g * h * k > n or h >= k:
    print('ничоси ты математик')
else:
    print('все равно не выйдет')

# 3)
if h * n != 0 and k <= n:
    print('Фальш')
else:
    print('Тру..ту - ру -ру')

# 4)
if not n == g:
    print('я так и задумывала программу')
else:
    print('хо -хо -хо')

# 5)
if g * k < n and not n > h:
    print('умеешь считать, однако')
else:
    print('не умеешь считать, садись, два')

# 6)
if g * h / k * n != (g + h + k + n):
    print('странно, но это так')
else:
    print("да -да, плюсы победили умножение")

# 7)
if g + k <= h - n or h * k > n:
    print('да все, все , бери свою добычу')
else:
    print('сбесился программист -проблема для компании')

# 8)
if not h / 1000 > 0:
    print('не давай ему сдачу')
else:
    print(" ему сдачи, Галя, три рубля отсыпь")

# 9)
if g * h > g // k:
    print('как так -то!')
else:
    print('нежданчик подкатил')

# 10)
if g ** 10 <= h or k ** 4 > n:
    print('учись считать большие числа')
else:
    print('отдыхай, детка')

# И скрипты на закуску

#  скрипт раз
print('Введите число:')
a = int(input())
if a > 30:
    print("Вы ввели число =", a, ', которое больше 30')
elif a < 30:
    print("Вы ввели число =", a, ', которое меньше 30')
else:
    print("Вы ввели число =", a, ', которое равно 30')

# скрипт  два
import random
print("*** А теперь решение второго скрипта ***")
print('Введите число')
a = int(input())
b = random.randint(1, 100)
if a > b:
    print("Вы ввели число =", a, ', которое больше сгенерированного числа')
elif a < b:
    print("Вы ввели число =", a, ', которое меньше сгенерированного числа')
else:
    print("Вы ввели число =", a, ', которое равно сгенерированному числу')

# и третий скрипт на закуску
import random
print("*** Осталось немного, потерпите ***")
print('Число набери, чувачек')
a = int(input())

b = random.randint(1, 100)
c = random.randint(1, 100)
if a > b and a > c:
    print("Вы ввели число =", a, ', которое больше сгенерированных  чисел')
elif a < b and a < c:
    print("Вы ввели число =", a, ', которое меньше сгенерированных  чисел')
elif a < b and a > c or a > b and a < c:
    print("Вы ввели число =", a, ', которое меньше одного сгенерированного числа и больше другого')
elif a == b and a == c:
    print('Вы ввели число =', a, ', которое равно сгенерированным числам')
elif a < b and a == c or a == b and a < c:
    print('Вы ввели число = ', a, ', которое меньше одного из сгенерированных чисел и равно другому')
else:
    print('Вы ввели число = ', a, ', которое больше одного из сгенерированных чисел и равно другому')
